{
  "2025-07-20": {
    "quote": "\"Mary has chosen the better part.\" (Lk 10:42)",
    "reading_summary": "Genesis shows Abraham's lavish welcome of three mysterious guests; the psalm exhorts integrity before God; Colossians reveals Christ as the long-hidden mystery; Luke contrasts Martha's anxious service with Mary's listening discipleship.  St. Margaret of Antioch, a 3rd-century virgin-martyr, reminds the Church that persevering faith overcomes every dragon of trial.",
    "psalm_summary": NaN,
    "gospel_summary": NaN,
    "daily_prayer": "Lord Jesus, teach us to combine Martha's generous service with Mary's attentive silence.  May our homes mirror Abraham's tent—places where strangers glimpse Your face, and where anxious hearts find rest in You.  Amen.",
    "saint_reflection": NaN,
    "exegesis": "The hospitality at Mamre prefigures the Eucharist: Abraham prepares bread, meat, milk and curds for the divine visitors, an Old Testament icon of Trinitarian self-gift and of the Sacrament by which God feeds His people.  Psalm 15 lists the inner dispositions—truthful speech, justice, reverence—that make a soul a worthy host for God's presence.  Paul, writing from prison, proclaims that \"Christ in you\" is the unveiled mystery first promised to Abraham's offspring and now offered to the Gentiles; suffering becomes participation in Christ's redemptive afflictions.  Luke situates Martha and Mary immediately after the Good Samaritan: service and contemplation are not rivals but two expressions of love, yet Jesus insists that receptivity to His Word must ground all action.  The following Sunday (Gn 18:20-32) will revisit Abraham, showing that true hospitality blossoms into intercessory courage for the world.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072025.cfm"
  },
  "2025-07-21": {
    "quote": "\"The LORD himself will fight for you; you have only to keep still.\" (Ex 14:14)",
    "reading_summary": "Israel faces the Red Sea with Egypt in pursuit; the victory song in Exodus 15 praises God's triumph; Jesus warns Pharisees that only the sign of Jonah will be given.  St. Lawrence of Brindisi—polyglot Capuchin preacher and Doctor of the Church—embodied fearless proclamation.",
    "psalm_summary": NaN,
    "gospel_summary": NaN,
    "daily_prayer": "Mighty Redeemer, still our anxious hearts before the waters of impossibility.  Teach us, like St. Lawrence, to trust the power of Your Word and to walk forward in faith while You open a path of freedom.  Amen.",
    "saint_reflection": NaN,
    "exegesis": "Pharaoh's change of heart illustrates the slavery of clinging to power; God deliberately hardens the oppressor's resolve to manifest an even greater deliverance.  The canticle celebrates God as warrior, foreshadowing Christ who conquers through the Cross.  Jesus refuses spectacle: the \"sign of Jonah\" points to His three-day entombment and rising, a victory greater than the parting sea.  Lawrence of Brindisi (1559-1619) debated Protestants in fluent Hebrew and preached crusades against Ottoman forces, relying on prayer as Israel trusted the LORD at the shore.  Tomorrow's feast of Mary Magdalene will unveil that decisive sign—an empty tomb.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072125.cfm"
  },
  "2025-07-22": {
    "quote": "\"I have seen the Lord!\" (Jn 20:18)",
    "reading_summary": "Song of Songs (optional) voices the bride's search; Psalm 63 thirsts for God; Paul proclaims new creation in Christ; John narrates Mary Magdalene as first witness to the Resurrection.  The feast elevates her as \"Apostle to the Apostles,\" a status Pope Francis restored in 2016.",
    "psalm_summary": NaN,
    "gospel_summary": NaN,
    "daily_prayer": "Risen Jesus, call us by name as You did Mary of Magdala; open our eyes to recognize You in Word and Sacrament and send us to announce Your living presence to a world still weeping in the garden.  Amen.",
    "saint_reflection": NaN,
    "exegesis": "Mary's nocturnal quest echoes the bride's longing in Canticles, fulfilled when the Gardener speaks her name—an Eden renewed.  Her tears turn to mission: \"Go to my brothers,\" linking personal encounter to ecclesial proclamation.  Paul's \"old has passed away\" interprets her transformation from afflicted sinner to herald of mercy.  Historically conflated with other Marys, she now shines distinctly, showing that redeemed humanity—male and female—shares in apostolic authority.  Her feast bridges yesterday's Exodus liberation and tomorrow's manna narrative: the Risen Lord is the Bread who satisfies every desert thirst.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072225.cfm"
  },
  "2025-07-23": {
    "quote": "\"This is the bread which the LORD has given you to eat.\" (Ex 16:15)",
    "reading_summary": "God rains manna and quail for Israel; the psalm recounts providence; Jesus sows the parable of the seed.  St. Bridget of Sweden—mystic and mother—models listening soil that bore abundant fruit for Europe's reform.",
    "psalm_summary": NaN,
    "gospel_summary": NaN,
    "daily_prayer": "Generous Father, feed us with the Bread of Heaven and cultivate in us hearts like good soil.  Through St. Bridget's intercession, may Your Word take root, heal divisions, and yield a harvest of holiness.  Amen.",
    "saint_reflection": NaN,
    "exegesis": "Manna, whose name means \"What is it?\", prefigures the Eucharist—daily sustenance testing trust beyond hoarded security.  The double portion on the sixth day shapes Sabbath spirituality: rest rooted in God's provision.  Matthew's Sower underscores reception: seed on rich soil stands for hearts like Bridget's, whose Revelations sprang from contemplation within family life and pilgrimage.  Today anticipates Thursday's Sinai theophany, showing that covenant communion begins with humble bread.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072325.cfm"
  },
  "2025-07-24": {
    "quote": "\"Blessed are your eyes, because they see.\" (Mt 13:16)",
    "reading_summary": "At Sinai, thunder, cloud and trumpet reveal the LORD; the Daniel canticle exults in eternal glory; Jesus explains why He teaches in parables.  Optional memorials of St. Sharbel Makhluf and St. Kunigunde witness to contemplative vision amid hidden life.",
    "psalm_summary": NaN,
    "gospel_summary": NaN,
    "daily_prayer": "Holy God, You speak amid cloud and whisper in parables.  Purify our senses to recognize Your presence in every symbol and sacrament.  May the hidden holiness of Your saints draw us into contemplative praise.  Amen.",
    "saint_reflection": NaN,
    "exegesis": "Israel's three-day preparation evokes baptismal cleansing before divine encounter; the mountain trembles, yet the covenant aims at intimacy.  Jesus quotes Isaiah to diagnose dull hearts; parables both veil and disclose, inviting disciples into deeper perception.  St. Sharbel (1828-1898), Maronite hermit, lived Eucharistic silence that \"saw\" God beyond words, while medieval Queen Kunigunde integrated prayer with governance.  The progression from manna (Wednesday) to Sinai (Thursday) mirrors sacramental initiation: nourished, then instructed.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072425.cfm"
  },
  "2025-07-25": {
    "quote": "\"We hold this treasure in earthen vessels.\" (2 Cor 4:7)",
    "reading_summary": "Paul describes apostolic weakness; Psalm 126 sings sowing in tears; Jesus challenges James and John to drink His chalice.  The feast of St. James the Greater recalls the first apostolic martyr and pilgrim patron of Compostela.",
    "psalm_summary": NaN,
    "gospel_summary": NaN,
    "daily_prayer": "Lord of Glory, strengthen us to share Your chalice like St. James.  Through our weaknesses display Your surpassing power, that many may be led along the Camino of faith toward Your eternal kingdom.  Amen.",
    "saint_reflection": NaN,
    "exegesis": "Clay jars were common trash-heap lamps in Corinth—imagery for fragile humanity radiating resurrection power.  The psalm's agricultural metaphor anticipates harvest after exile, resonating with James who left nets for mission and finally sowed his blood in Jerusalem.  Matthew contrasts worldly ambition with servant leadership; Jesus turns \"right and left\" seats into a cross-shaped throne.  The next day's memorial of Joachim and Anne will honor the roots from which this apostolic mission springs.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072525.cfm"
  },
  "2025-07-26": {
    "quote": "\"All that the LORD has said, we will heed and do.\" (Ex 24:7)",
    "reading_summary": "Sirach praises Israel's ancestors; Psalm 132 celebrates David's covenant; Jesus blesses eyes that see what prophets longed to behold.  Saints Joachim and Anne embody the faithful lineage that prepared the Virgin Mary.",
    "psalm_summary": NaN,
    "gospel_summary": NaN,
    "daily_prayer": "God of our fathers, thank You for the quiet faith of Joachim and Anne.  Root our families in obedience to Your word, that future generations may see and rejoice in the wonders You continue to perform.  Amen.",
    "saint_reflection": NaN,
    "exegesis": "Sirach 44 links remembrance with covenant fidelity; the ancestors' glory lives in virtuous descendants.  Psalm 132 recalls God's oath to seat David's heir—fulfilled in Christ born of Mary, granddaughter of Joachim and Anne.  Jesus' beatitude to disciples situates them within salvation history: promises to Abraham, David, and the prophets culminate in the kingdom they now witness.  Saturday's readings form an inclusio with last Sunday's hospitality: the covenant family becomes the dwelling where God pitches His tent.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072625.cfm"
  }
}